IDEA StatiCa Open Model
SectionCharacteristics.Cgz Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets the centre of gravity related to the axis Z.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Cgz { get; set; }
Public Property Cgz As Double
	Get
	Set
public:
property double Cgz {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
SectionCharacteristics Class
IdeaRS.OpenModel.Geometry2D Namespace